---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.FlowConfigMismatch
source: html/a7d72e26-4e44-9690-e295-c133f32b1763.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.FlowConfigMismatch Property

[Element Name]: It is not possible to calculate the flow since all the components in this system have the flow configuration
 set to Preset or System. At least one component is required to have the flow configuration set to Calculated.

## Syntax (C#)
```csharp
public static FailureDefinitionId FlowConfigMismatch { get; }
```